app/Controllers/AdminController.php

SELECT *
FROM `transactions`
---
    public function index()
    {
        $menuModel        = new MenuModel();
        $userModel        = new UserModel();
        $reservationModel = new ReservationModel();
        $transactionModel = new TransactionModel();
        $discountModel    = new DiscountModel();

        $today         = date('Y-m-d');
        $thisMonth     = date('Y-m');
        $thisWeekStart = date('Y-m-d', strtotime('monday this week'));
        $thisWeekEnd   = date('Y-m-d', strtotime('sunday this week'));

        $allTransactions = $transactionModel->findAll();

SELECT *
FROM `reservations`
WHERE `reservation_date` = '2026-04-02'
ORDER BY `reservation_time` ASC
---
            $count++;
        }

        $todayReservations = $reservationModel->where('reservation_date', $today)
                                              ->orderBy('reservation_time', 'ASC')
                                              ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `menus`
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `reservations`
SELECT COUNT(*) AS `numrows`
FROM `discounts`
---
            }
        }

        $data = [
            'menusCount'        => $menuModel->countAllResults(),
            'usersCount'        => $userModel->countAllResults(),
            'reservationsCount' => $reservationModel->countAllResults(),
            'transactionsCount' => count($allTransactions),
            'discountsCount'    => $discountModel->countAllResults(),

            'todayTotal'        => $todayTotal,
            'todayTransactions' => $todayTransactions,
            'weekTotal'         => $weekTotal,
            'monthTotal'        => $monthTotal,

            'cashCount'         => $cashCount,
            'qrisCount'         => $qrisCount,
            'cardCount'         => $cardCount,

            'topMenus'          => $topMenus,
            'todayReservations' => $todayReservations,
            'confirmedReservationsCount' => $confirmedReservationsCount
        ];