app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function process()
    {
        $session = session();
        $userModel = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $userModel->where('username', $username)->first();