app/Controllers/DiscountController.php

    public function index()
    {
        $data = [
            'discounts' => $this->discountModel->orderBy('created_at', 'DESC')->findAll()
        ];
---
SELECT *
FROM `discounts`
ORDER BY `created_at` DESC

    public function delete($id)
    {
        $this->discountModel->delete($id);
---
DELETE FROM `discounts`
WHERE `id` IN ('2')