app/Controllers/MenuController.php

SELECT *
FROM `categories`
---
    public function index()
    {
        $data = [
            'menus'      => $this->menuModel->getMenusWithCategory(),
            'categories' => $this->categoryModel->findAll()

INSERT INTO `menus` (`category_id`, `name`, `price`, `variants`, `created_at`, `updated_at`) VALUES ('3', 'Kopi Susu', '15000', 'Hot, Ice', '2026-03-24 05:47:56', '2026-03-24 05:47:56')
---
    public function store()
    {
        $this->menuModel->save([
            'category_id' => $this->request->getPost('category_id'),
            'name'        => $this->request->getPost('name'),
            'price'       => $this->request->getPost('price'),
            'variants'    => $this->request->getPost('variants')
        ]);