app/Controllers/OwnerController.php

    public function index()
    {
        $menuModel = new MenuModel();
        $userModel = new UserModel();
        $discountModel = new DiscountModel();

        $today         = date('Y-m-d');
        $thisMonth     = date('Y-m');
        $thisWeekStart = date('Y-m-d', strtotime('monday this week'));
        $thisWeekEnd   = date('Y-m-d', strtotime('sunday this week'));

        $allTransactions = $this->transactionModel->findAll();
---
SELECT *
FROM `transactions`

            $topMenus[] = ['name' => $name, 'qty' => $qty];
        }

        $todayReservations = $this->reservationModel->where('reservation_date', $today)
                                              ->orderBy('reservation_time', 'ASC')
                                              ->findAll();

        $confirmedReservationsCount = count(array_filter($todayReservations, fn($r) => in_array($r['status'], ['confirmed', 'completed'])));

        return view('owner/dashboard', [
            'menusCount'        => $menuModel->countAllResults(),
            'usersCount'        => $userModel->countAllResults(),
            'reservationsCount' => $this->reservationModel->countAllResults(),
            'transactionsCount' => count($allTransactions),
            'discountsCount'    => $discountModel->countAllResults(),
            'todayTotal'        => $todayTotal,
            'todayTransactions' => $todayTransactions,
            'weekTotal'         => $weekTotal,
            'monthTotal'        => $monthTotal,
            'cashCount'         => $cashCount,
            'qrisCount'         => $qrisCount,
            'cardCount'         => $cardCount,
            'topMenus'          => $topMenus,
            'todayReservations' => $todayReservations,
            'confirmedReservationsCount' => $confirmedReservationsCount
        ]);
---
SELECT *
FROM `reservations`
WHERE `reservation_date` = '2026-03-30'
ORDER BY `reservation_time` ASC
SELECT COUNT(*) AS `numrows`
FROM `menus`
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `reservations`
SELECT COUNT(*) AS `numrows`
FROM `discounts`

    public function salesReport()
    {
        $startDate = $this->request->getGet('start_date') ?: date('Y-m-01');
        $endDate   = $this->request->getGet('end_date') ?: date('Y-m-t');

        $transactions = $this->transactionModel->select('transactions.*, users.name as cashier_name')
                        ->join('users', 'users.id = transactions.cashier_id', 'left')
                        ->where('transactions.created_at >=', $startDate . ' 00:00:00')
                        ->where('transactions.created_at <=', $endDate . ' 23:59:59')
                        ->orderBy('transactions.created_at', 'DESC')
                        ->findAll();
---
SELECT `transactions`.*, `users`.`name` as `cashier_name`
FROM `transactions`
LEFT JOIN `users` ON `users`.`id` = `transactions`.`cashier_id`
WHERE `transactions`.`created_at` >= '2026-04-01 00:00:00'
AND `transactions`.`created_at` <= '2026-04-30 23:59:59'
ORDER BY `transactions`.`created_at` DESC

    public function reservations()
    {
        // 1. Ambil tanggal dari parameter GET 'date', jika kosong gunakan tanggal hari ini
        $selectedDate = $this->request->getGet('date') ?? date('Y-m-d');

        // 2. Ambil data reservasi berdasarkan tanggal yang dipilih
        $reservations = $this->reservationModel
            ->where('reservation_date', $selectedDate)
            ->orderBy('reservation_time', 'ASC') // Ubah ke ASC agar berurutan dari pagi ke malam
            ->findAll();
---
SELECT *
FROM `reservations`
WHERE `reservation_date` = '2026-04-02'
ORDER BY `reservation_time` ASC