app/Controllers/PosController.php

SELECT *
FROM `categories`
SELECT *
FROM `discounts`
WHERE `valid_until` >= '2026-03-25'
---
    public function index()
    {
        $menuModel     = new MenuModel();
        $categoryModel = new CategoryModel();
        $discountModel = new DiscountModel();

        $data = [
            'menus'      => $menuModel->getMenusWithCategory(),
            'categories' => $categoryModel->findAll(),
            'discounts'  => $discountModel->where('valid_until >=', date('Y-m-d'))->findAll()

INSERT INTO `transactions` (`transaction_id`, `cashier_id`, `total`, `payment_method`, `items`, `created_at`, `updated_at`) VALUES ('TRX-20260402-25858', '2', 20000, 'cash', '[{\"id\":\"6\",\"name\":\"Mie Rebus\",\"price\":15000,\"qty\":1},{\"id\":\"3\",\"name\":\"Teh Manis\",\"price\":5000,\"qty\":1}]', '2026-04-02 03:51:31', '2026-04-02 03:51:31')
---
    public function checkout()
    {
        $json = $this->request->getJSON();

        if (!$json) {
            return $this->response->setJSON([
                'status'  => 'error',
                'message' => 'Data tidak valid',
                'csrf'    => csrf_hash()
            ]);
        }

        $transactionModel = new \App\Models\TransactionModel();

        $trx_id = 'TRX-' . date('Ymd') . '-' . rand(10000, 99999);

        $saved = $transactionModel->save([
            'transaction_id' => $trx_id,
            'cashier_id'     => session()->get('id'),
            'total'          => $json->total,
            'payment_method' => $json->payment_method,
            'items'          => json_encode($json->items)
        ]);

SELECT *
FROM `reservations`
WHERE `reservation_date` = '2026-04-02'
ORDER BY `reservation_time` ASC
---
    public function getReservations()
    {
        $date = $this->request->getGet('date') ?? date('Y-m-d');
        $reservationModel = new \App\Models\ReservationModel();

        // Ambil data reservasi berdasarkan tanggal yang dipilih
        $reservations = $reservationModel->where('reservation_date', $date)
                                         ->orderBy('reservation_time', 'ASC')
                                         ->findAll();

INSERT INTO `reservations` (`customer_name`, `customer_phone`, `reservation_date`, `reservation_time`, `guest_count`, `notes`, `status`, `created_at`, `updated_at`) VALUES ('Asep', '081234567890', '2026-04-02', '16:00', '20', '', 'pending', '2026-04-02 03:51:14', '2026-04-02 03:51:14')
---
    public function storeReservation()
    {
        $json = $this->request->getJSON();

        if (!$json) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Data tidak valid', 'csrf' => csrf_hash()]);
        }

        $reservationModel = new \App\Models\ReservationModel();

        $saved = $reservationModel->save([
            'customer_name'    => $json->customer_name,
            'customer_phone'   => $json->customer_phone,
            'reservation_date' => $json->reservation_date,
            'reservation_time' => $json->reservation_time,
            'guest_count'      => $json->guest_count,
            'notes'            => $json->notes,
            'status'           => 'pending'
        ]);

SELECT *
FROM `transactions`
WHERE `cashier_id` = '2'
AND  `created_at` LIKE '%2026-04-02%' ESCAPE '!'
ORDER BY `created_at` DESC
---
    public function getTransactions()
    {
        $date = $this->request->getGet('date') ?? date('Y-m-d');
        $cashierId = session()->get('id');
        $transactionModel = new \App\Models\TransactionModel();

        $transactions = $transactionModel->where('cashier_id', $cashierId)
                                         ->like('created_at', $date)
                                         ->orderBy('created_at', 'DESC')
                                         ->findAll();