app/Controllers/ReportController.php

    public function index()
    {
        $startDate = $this->request->getGet('start_date');
        $endDate   = $this->request->getGet('end_date');

        $query = $this->transactionModel->select('transactions.*, users.name as cashier_name')
                                        ->join('users', 'users.id = transactions.cashier_id', 'left');

        if (!empty($startDate) && !empty($endDate)) {
            $query->where('transactions.created_at >=', $startDate . ' 00:00:00')
                  ->where('transactions.created_at <=', $endDate . ' 23:59:59');
        } else {
            $startDate = date('Y-m-01');
            $endDate   = date('Y-m-t');
            $query->where('transactions.created_at >=', $startDate . ' 00:00:00')
                  ->where('transactions.created_at <=', $endDate . ' 23:59:59');
        }

        $transactions = $query->orderBy('transactions.created_at', 'DESC')->findAll();
---
SELECT `transactions`.*, `users`.`name` as `cashier_name`
FROM `transactions`
LEFT JOIN `users` ON `users`.`id` = `transactions`.`cashier_id`
WHERE `transactions`.`created_at` >= '2026-04-01 00:00:00'
AND `transactions`.`created_at` <= '2026-04-30 23:59:59'
ORDER BY `transactions`.`created_at` DESC