app/Controllers/ReservationController.php

SELECT *
FROM `reservations`
ORDER BY `reservation_date` DESC, `reservation_time` DESC
---
    public function index()
    {
        $data = [
            'reservations' => $this->reservationModel
                                ->orderBy('reservation_date', 'DESC')
                                ->orderBy('reservation_time', 'DESC')
                                ->findAll()
        ];

UPDATE `reservations` SET `status` = 'confirmed', `updated_at` = '2026-04-02 04:03:10'
WHERE `reservations`.`id` IN ('3')
---
    public function updateStatus($id)
    {
        $status = $this->request->getPost('status');
        if (in_array($status, ['pending', 'confirmed', 'completed', 'cancelled'])) {
            $this->reservationModel->update($id, ['status' => $status]);