app/Models/MenuModel.php

SELECT `menus`.*, `categories`.`name` as `category_name`
FROM `menus`
LEFT JOIN `categories` ON `categories`.`id` = `menus`.`category_id`
---
    public function getMenusWithCategory()
    {
        return $this->select('menus.*, categories.name as category_name')
                    ->join('categories', 'categories.id = menus.category_id', 'left')
                    ->findAll();